Repository: OmegaT-L10N/ar
Catalog: tm/3.1_aligned.tmx
Source language: en
Languages: ar

source: Changed after:
ar: معدل بعد:

source: Changed &before:
ar: معدل &قبل:

source: C&ase sensitive
ar: ح&ساس لحالة اﻷحرف

source: Space matches &nbsp
ar: ت&طابقات الفضاءات الفارغة nbsp

source: Search in
ar: البحث في

source: Memor&y
ar: ذاكر&ة

source: T&Ms
ar: ذاكرات& الترجمة

source: &Glossaries
ar: &المسارد

source: &Translated
ar: &مترجم

source: U&ntranslated
ar: غير&مترجم

source: In so&urce
ar: في ال&مصدر

source: &In translation
ar: &في الترجمة

source: Trans&lated or untranslated
ar: متر&جم أو غير مترجم

source: Display:
ar: عرض:

source: all matching segments
ar: كافة المقاطع المتطابقة

source: file names
ar: أسماء الملفات

source: Location
ar: الموضع

source: Select Fol&der
ar: اختر مجل&داً

source: &Files
ar: &ملفات

source: Pro&ject
ar: مشر&وع

source: Recursi&ve search
ar: بحث &قائم على الاستدعاء الذاتي

source: Text Search
ar: البحث عن نص

source: Text Replace
ar: استبدال نص

source: You are going to modify {0} segments.
ar: سوف تقوم بتعديل {0} مقطع/مقاطع.

source: Do you want to continue?
ar: هل تود المتابعة؟

source: Number of matching segments:
ar: عدد المقاطع المتطابقة:

source: Searches can be performed in the source and/or in the translation and/or in notes and/or in comments.
ar: يمكنك إجراء البحث في نص المصدر و/أو الترجمة و/أو الملاحظات و/أو التعليقات.

source: Searches are done within the current project or in any folder or folder structure.
ar: تجرى اﻷبحاث في المشروع الحالي أو في أي مجلد أو بنية مجلدات.

source: Exact searches look for the entire specified query string.
ar: تسمح عمليات البحث الدقيق بالعثور على سلاسل الاستعلام المحددة بأكملها.

source: Keyword searches regard the specified query string as a set of search keywords (separated by space) and return all segments which contain all of the query words, in any order.
ar: عمليات البحث عبر الكلمات الدلالية تعامل سلسلة الاستعلام المستخدمة كمجموعة من الكلمات الدلالية (مفصولة بفراغات)، مما يسمح بالحصول على كافة المقاطع التي تتضمن الكلمات المطلوبة، في أي ترتيب كان.

source: Both search types support the wildcard characters * and ?.
ar: يدعم نمطا البحث المذكورين معاً الرمزين العشوائيين * و?.

source: The '*' character matches zero or more characters (the search term 'run*' would match 'run', 'runs', and 'running', for example). The '?'
ar: الرمز '*' يتطابق مع الصفر أو ما يفوق ذلك من اﻷحرف (المصطلح '*run' يتطابق مثلاً مع 'runs'، 'run' و'running').

source: character matches exactly one character ('run?' would match 'runs' and 'rung', for example, but not 'run' or 'running').
ar: الرمز '?' يتطابق مع حرف واحد بالضبط (المصطلح '?run' سيتطابق مع 'runs' و'rung' مثلاً، لكنه لن يتطابق مع 'run' أو 'running').

source: Maximum number of finds has been reached ({0})
ar: تم بلوغ العدد اﻷقصى للمقاطع المعثور عنها ({0})

source: Error searching directory tree!
ar: حصل خطأ عند البحث في شجرة الأدلة!

source: Bad regular expression!
ar: تعبير نظامي خاطئ!

source: Bad folder name {0}
ar: اسم مجلد غير صالح {0}

source: Search thread died unexpectedly!
ar: سلسلة البحث توقفت بشكل مفاجئ!

source: Please close search window.
ar: يرجى إغلاق نافذة البحث.

source: No matches returned by search.
ar: لم يتم العثور على أي نتائج للبحث.

source: Nr of matching segments: {0}
ar: عدد المقاطع المتطابقة: {0}

source: Glossary
ar: مسرد المصطلحات

source: +{0} more
ar: +{0} أكثر

source: {0} +{1} more
ar: {0} +{1} أكثر

source: Unable to initialize read of XML file!
ar: تعذر تشغيل قراءة ملف XML!

source: Unsupported XML version {0}!
ar: إصدار XML غير مدعم {0}!

source: Not a valid XML file!
ar: ملف XML غير صالح!

source: Cannot load specified XML file!
ar: تعذر تحميل ملف XML المحدد!

source: IOException encountered:
ar: تم العثور على استثناء دخل/خرج:

source: Unexpected char {0} ({1})!
ar: حرف غير منتظر {0} ({1})!

source: Confused by false start of comment tag!
ar: خلل راجع لبداية خاطئة لعلامة التعليق!

source: Tag name:
ar: اسم العلامة:

source: (comment tag)
ar: (علامة التعليق)

source: Floating '?' character not tied to '>'!
ar: حرف '?' طاف غير مرتبط برمز '>'!

source: (empty tag)
ar: (علامة فارغة)

source: (close tag)
ar: (علامة إغلاق)

source: loaded
ar: محمل

source: attributes.
ar: السمات.

source: End of stream encountered without finding close block!
ar: تم العثور على نهاية الدفق دون العثور على مجموعة الإغلاق!

source: Escaped character never terminated!
ar: الحرف المُخلَّص لم ينته أبداً!

source: Escaped binary char contains malformed data ({0})!
ar: الحرف الثنائي المخلص يتصمن بيانات سيئة التكوين ({0})!

source: Escaped decimal char contains malformed data ({0})!
ar: الحرف العشري المخلص يتضمن بيانات سيئة التكوين ({0})!

source: File {0} does not exist!
ar: الملف {0} غير متوفر!

source: Preferences system save operation failed!
ar: فشلت عملية حفظ التفضيلات على مستوى النظام!

source: Parse error encountered reading preferences file!
ar: تم العثور على خطأ تحليل أثناء قراءة ملف التفضيلات!

source: Unsupported file encoding
ar: ترميز ملف غير مدعم

source: Unable to read file
ar: تعذر قراءة الملف

source: Unsupported project file version ({0})!
ar: إصدار ملف مشروع غير مدعم ({0})!

source: Reading TMX file {0}
ar: جار قراءة ملف TMX {0}

source: Reading of TMX file complete
ar: تمت قراءة ملف TMX

source: Created by: {0}
ar: أنشأ من طرف: {0}

source: Version: {0}
ar: إصدار: {0}

source: Segmentation method: {0}
ar: طريقة التجزئة: {0}

source: Source language: {0}
ar: لغة المصدر: {0}

source: Variants in the following languages will be displayed: {0}
ar: سوف يتم عرض المتغيرات في اللغات التالية: {0}

source: Exception while parsing:
ar: حدث استثناء أثناء تحليل البيانات:

source: An exception occurred while parsing the TMX file {0} The TMX file will not be loaded.
ar: حدث استثناء أثناء قراءة ملف TMX {0} لن يحمل ملف TMX.

source: Please consult the log ({1}) to determine the source of the error and try again.
ar: يرجى الاطلاع على ملف السجل ({1}) لتحديد مصدر الخلل والمحاولة من جديد.

source: Warning on line {0}, column {1} while parsing:
ar: تحذير على السطر {0}, عمود {1} أثناء تحليل البيانات:

source: Recoverable error on line {0}, column {1} while parsing:
ar: خطأ قابل للإصلاح على السطر {0}, عمود {1} أثناء تحليل البيانات:

source: Fatal error on line {0}, column {1} while parsing:
ar: خطأ فادح على السطر {0}, عمود {1} أثناء تحليل البيانات:

source: Unrecoverable error while parsing TMX file {0} on line {1}, column {2}.
ar: خطأ غير قابل للإصلاح أثناء تحليل بيانات ملف TMX {0} على السطر {1}, عمود {2}.

source: The TMX file will not be loaded Please try to correct the error and reload the project.
ar: لن يتم تحميل ملف TMX. يرجى تصحيح الخطأ وإعادة تحميل المشروع.

source: Translation unit encountered before TMX header.
ar: تم العثور على وحدة ترجمة قبل ترويسة TMX.

source: Translation unit variant encountered outside translation unit.
ar: تم العثور على متغير وحدة الترجمة خارج وحدة الترجمة.

source: Variant skipped.
ar: تم تخطي المتغير.

source: Language not specified for translation unit variant.
ar: لغة غير محددة لمتغير وحدة الترجمة.

source: Segment encountered outside translation unit variant.
ar: تم العثور على مقطع خارج متغير وحدة الترجمة.

source: Segment skipped.
ar: تم تخطي المتغير.

source: Source segment could not be located for certain translation units.
ar: تعذر تحديد موضع مقطع المصدر لبعض وحدات الترجمة.

source: These units have been skipped.
ar: تم تخطي الوحدات المعنية.

source: The TMX source language ({0}) is different from the project source language ({1}).
ar: لغة مصدر ذاكرة TMX ({0}) مختلفة عن لغة مصدر المشروع ({1}).

source: The TMX file will continue to be loaded.
ar: سوف تتم مواصلة تحميل ملف TMX.

source: TMX file was created by OmegaT 1.4.x or earlier.
ar: تم إنشاء ملف TMX بواسطة الإصدار OmegaT 1.4.x أو إصدار أقدم منه.

source: Upgrading...
ar: جار ترقية الملف...

source: Your current project uses sentence segmentation, but TMX file was created using paragraph segmentation.
ar: مشروعك الحالي يستخدم تجزئة الجمل، لكن ملف TMX أنشأ باستخدام تجزئة الفقرات.

source: OmegaT will try to resegment the TMX file...
ar: سوف يحاول أوميجاتي إعادة تجزئة ملف TMX...

source: Error reading TMX level2 at line {0} column {1}
ar: وقع خطأ خلال قراءة TMX level2 على السطر {0} عمود {1}

source: Loading glossary {0}
ar: جار تحميل المسرد {0}

source: Added {0} glossary entries from {1}
ar: تم إضافة {0} مدخل/مداخل من بين {1}

source: Could not initialize OS look and feel!
ar: تعذر إطلاق بيئة نظام التشغيل!

source: Unknown plugin type in '{0}'
ar: نمط ملحق برمجي مجهول في '{0}'

source: Error initializing marker '{0}'
ar: خطأ أثناء إطلاق الواسم '{0}'

source: Error load plugin from class '{0}': {1}: {2}
ar: خطأ أثناء تحميل الملحق البرمجي من الفئة '{0}': {1}: {2}

source: Error unload plugin from class '{0}': {1}
ar: خطأ عدم تحميل الملحق البرمجي من الفئة '{0}': {1}

source: Jar used for plugins: {0}
ar: صيغة Jar مستخدمة للملحقات البرمجية: {0}

source: Plugin successfully loaded from class '{0}'
ar: ملحق برمجي محمل بنجاح من الفئة '{0}'

source: Unable to parse filters configuration file
ar: تعذر تحليل بيانات ملف تكوين المرشحات

source: Unable to save filters configuration file
ar: تعذر حفظ ملف تكوين المرشحات

source: Filter '{0}' could not be loaded from '{1}'
ar: تعذر تحميل المرشح '{0}' من '{1}'

source: File Format
ar: صيغة الملف

source: Enabled
ar: مُفَعَّل

source: Column Index must be equal to 1
ar: يجب أن يكون مؤشر العمود معادلاً للقيمة 1

source: Source Filename Pattern
ar: نمط اسم ملف المصدر

source: Source File Encoding
ar: ترميز ملف المصدر

source: Translated File Encoding
ar: ترميز الملف المترجم

source: Translated Filename Pattern
ar: نمط اسم ملف الترجمة

source: PO Filter Options
ar: خيارات مرشح PO

source: &Allow blank translations in the target files
ar: &السماح بتوفر ترجمات فارغة في ملفات المصدر

source: Allow translating &blank source segments
ar: السماح بترجمة &مقاطع المصدر الفارغة

source: &Skip PO header
ar: &تخطي ترويسة PO

source: Auto replace 'nplurals=INTEGER; &plural=EXPRESSION;' in header
ar: تعويض تلقائي 'nplurals=INTEGER; &plural=EXPRESSION;' في الترويسة

source: Format:
ar: الصيغة:

source: Standard
ar: معياري

source: Monolingual
ar: أحادي اللغة

source: The PO filter threw an exception:
ar: مرشح ملفات PO أصدر خطأ استثنائياً:

source: Invalid file format
ar: صيغة ملفات غير صالحة

source: PDF Input
ar: دخل PDF

source: Windows Resources
ar: موارد ويندوز

source: Mozilla DTD Filter Options
ar: خيارات مرشح Mozilla DTD

source: &Remove untranslated strings in the target files
ar: &حذف السلاسل غير المترجمة في ملفات الهدف

source: The Mozilla DTD filter threw an exception:
ar: مرشح Mozilla DTD أصدر خطأ استثنائياً:

source: ---- Localization Notes ----
ar: ---- ملاحظات خاصة بالتوطين ----

source: Text
ar: النص

source: Text Filter Options
ar: خيارات مرشح النصوص

source: Segment source text into paragraphs on:
ar: تجزئة نص المصدر إلى فقرات عند:

source: &Line breaks
ar: &فواصل السطور

source: &Empty lines
ar: &السطور الفارغة

source: &Never
ar: &أبداً

source: Options to set the line length in target documents (0 = no limit)
ar: خيارات تحديد طول السطر في مستندات الهدف (0 = غير محدود)

source: Line length:
ar: طول السطر:

source: Maximum line length:
ar: طول السطر الأقصى:

source: Java(TM) Resource Bundles
ar: حزم موارد Java(TM)

source: Encountered illegal \u sequence
ar: تم العثور على سلسلة \u غير مشروعة

source: Java Resource Bundles Filter Options
ar: خيارات مرشح حزم موارد جافا

source: The Java Resource Bundles filter threw an exception:
ar: مرشح حزم موارد جافا أصدر خطأ استثنائياً:

source: Help & Manual
ar: دليل & المستخدم

source: Camtasia for Windows
ar: كامتاسيا لويندوز

source: SVG Image and Adobe Illustrator Export
ar: تصدير صور SVG وAdobe Illustrator

source: Flash XML Export
ar: تصدير Flash XML

source: Error in file {0}, line {1}
ar: خطأ في الملف {0}, بالسطر {1}

source: Note: DocBook files are recognized not only by file extension, but they also must have a DOCTYPE declaration: <!DOCTYPE book PUBLIC \"-//OASIS//DTD DocBook XML... for DocBook 4, or a Namespace: xmlns="http://docbook.org/ns/docbook" for DocBook 5
ar: ملاجظة: لا يتم التعرف على ملفات DocBook من خلال امتداد الملف فقط، بل ينبغي أن تتوفر أيضاً على تصريح DOCTYPE على الشكل: <!DOCTYPE book PUBLIC \"-//OASIS//DTD DocBook XML... بالنسبة إلى DocBook 4, أو مساحة الاسم: xmlns="http://docbook.org/ns/docbook" بالنسبة إلى DocBook 5

source: SubRip Subtitles
ar: ترجمات SubRip

source: Android Resources
ar: موارد أندرويد

source: Key=Value Text
ar: نصوص Key=Value

source: ILIAS Language File
ar: ملفات اللغة ILIAS

source: OpenDocument Filter Options
ar: خيارات مرشح OpenDocument

source: Translate the following elements:
ar: ترجمة العناصر اﻵتية:

source: &Index entries
ar: &مداخل المؤشرات

source: &Bookmarks
ar: &العلامات

source: Bookmark &references
ar: مراجع &العلامات

source: &Notes
ar: &ملاحظات

source: &Comments
ar: &تعليقات

source: &Presentation notes
ar: &ملاحظات العروض

source: Links (&URL)
ar: الروابط (&URL)

source: &Sheet Names
ar: &أسماء الصفحات

source: Error in file
ar: خطأ في الملف

source: XLIFF Filter Options
ar: خيارات ملف XLIFF

source: Specify tag handling behaviour
ar: تحديد سلوك معالجة العلامات

source: &Compatibility with OmegaT 2.6
ar: &التوافق مع أوميجاتي 2.6

source: Identifier used for alternative translations
ar: معرف مستخدم للترجمات البديلة

source: Previous and &next paragraphs
ar: الفقرتان &السابقة واللاحقة

source: <trans-unit> I&D
ar: <وحدة ـ الترجمة> I&D

source: <trans-unit> &resname attribute when available
ar: <وحدة ـ الترجمة> &إعادة تسمية السمة في حالة توفرها

source: When unavailable, the ID will be used as a fallback
ar: في حالة عدم التواجد، فإن المعرف سيستخدم كعنصر احتياطي

source: The following options apply to the 3.x filter only
ar: تطبق هذه الخيارات على مرشح 3.x لوحده

source: &Force shortcut to "f" for <it pos="end"> tags
ar: &فرض المختصر "f" بالنسبة لعلامات <it pos="end">

source: &Ignore type and ctype attributes when building <ph> tag shortcuts
ar: &تجاهل سمات type وctype عند إنشاء مختصرات علامة <ph>

source: Ignore type and ctype attributes when building <&bpt> and <ept> tag shortcuts
ar: تجاهل سمات type وctype عند إنشاء مختصرات العلامتين <&bpt> و<ept>

source: Open XML Filter Options
ar: خيارات مرشح Open XML

source: Non-visible Instruction Te&xt
ar: &نص اﻷوامر غير الظاهر

source: Co&mments
ar: &تعليقات

source: &Footnotes
ar: &تعليقات في أسفل الصفحة

source: &Endnotes
ar: &التعليقات الختامية

source: He&aders
ar: &الترويسات

source: Foote&rs
ar: &المذيلات

source: Duplicate Fallbac&k Text
ar: &نسخ النص الاحتياطي

source: Comme&nts
ar: &تعليقات

source: S&lide Comments
ar: ت&عليقات الشرائح

source: Sli&de Masters
ar: الشر&ائح الرئيسية

source: Slide La&youts
ar: تصميمات& الشرائح

source: Slide External Lin&ks
ar: الروابط&الخارجية للشريحة

source: Global
ar: شمولي

source: C&harts
ar: خطا&طات

source: D&iagrams
ar: رسوم&بيانية

source: Dra&wings
ar: رسوم&

source: Other Options:
ar: خيارات أخرى:

source: A&ggregate Tags
ar: تجميع& العلامات

source: &Preserve spaces for all tags
ar: &حفظ المسافات لكافة العلامات

source: OmegaT version {0}
ar: أويجاتي إصدار {0}

source: OmegaT version {0}, update {1}
ar: أوميجاتي إصدار {0}, تحديث {1}

source: About OmegaT
ar: حول أومياتي

source: Copyright © 2000-2014 Keith Godfrey, Maxym Mykhalchuk and others
ar: جميع الحقوق محفوظة © 2000-2014 كيث كودفري، ماكسيم ميخالشوك وآخرون

source: &License
ar: &رخصة

source: OmegaT is a free and open source multiplatform Computer Assisted Translation tool with fuzzy matching, translation memory, keyword search, glossaries, and translation leveraging into updated projects.
ar: أوميجاتي عبارة عن أداة متعددة المنصات، مجانية ومفتوحة المصدر للترجمة المستعينة بالحاسوب. يتوفر أوميجاتي على وظيفة المطابقة التقريبية، وذاكرات الترجمة والبحث عن الكلمات المفتاحية ومسارد المصطلحات واستغلال الترجمات المتوفرة في المشاريع عند تحديثها.

source: OmegaT is the original work of Keith Godfrey.
ar: أوميجاتي عمل أصلي من إنجاز Keith Godfrey.

source: Didier Briel is the OmegaT project manager.
ar: Didier Briel هو منسق مشروع أوميجاتي.

source: Code has been contributed by: Zoltan Bartko, Volker Berlin, Didier Briel, Kim Bruning, Alex Buloichik (lead developer), Thomas Cordonnier, Sandra Jean Chua, Enrique Estévez Fernández, Martin Fleurke, Wildrich Fourie, Phillip Hall, Jean-Christophe Helary, Thomas Huriaux, Hans-Peter Jacobs, Kyle Katarn, Piotr Kulik, Ibai Lakunza Velasco, Guido Leenders, Aaron Madlon-Kay, Fabián Mandelbaum, Manfred Martin, Adiel Mittmann, John Moran, Maxym Mykhalchuk, Arno Peters, Henry Pijffers, Briac Pilpré, Tiago Saboga, Andrzej Sawuła, Benjamin Siband, Yu Tang, Rashid Umarov, Antonio Vilei, Ilia Vinogradov, Martin Wunderlich and Michael Zakharov
ar: تمت المساهمة في تطوير البرنامج من قبل: Zoltan Bartko, Volker Berlin, Didier Briel, Kim Bruning, Alex Buloichik (lead developer), Thomas Cordonnier, Sandra Jean Chua, Enrique Estévez Fernández, Martin Fleurke, Wildrich Fourie, Phillip Hall, Jean-Christophe Helary, Thomas Huriaux, Hans-Peter Jacobs, Kyle Katarn, Piotr Kulik, Ibai Lakunza Velasco, Guido Leenders, Aaron Madlon-Kay, Fabián Mandelbaum, Manfred Martin, Adiel Mittmann, John Moran, Maxym Mykhalchuk, Arno Peters, Henry Pijffers, Briac Pilpré, Tiago Saboga, Andrzej Sawuła, Benjamin Siband, Yu Tang, Rashid Umarov, Antonio Vilei, Ilia Vinogradov, Martin Wunderlich وMichael Zakharov

source: Other contributions are detailed in the readme.txt file
ar: سوف تجدون المزيد من التفاصيل عن المساهمات في ملف readme.txt

source: OmegaT uses the following libraries:
ar: يستخدم أوميجاتي المكتبات البرمجية اﻵتية:

source: HTMLParser 1.6 by Somik Raha, Derrick Oswald and others (LGPL License)
ar: HTMLParser 1.6 من إنجاز Somik Raha ،Derrick Oswald وآخرين (رخصة LGPL)

source: VLDocking Framework 3.0.5-SNAPSHOT (LGPL License)
ar: VLDocking Framework 3.0.5-SNAPSHOT (رخصة LGPL)

source: Hunspell by László Németh and others (LGPL License)
ar: Hunspell من إنجاز László Németh وآخرين (رخصة LGPL)

source: JNA by Todd Fast, Timothy Wall and others (LGPL License)
ar: JNA من إنجاز Todd Fast ،Timothy Wall وآخرين (رخصة LGPL)

source: Swing-Layout 1.0.4 (LGPL License)
ar: Swing-Layout 1.0.4 (رخصة LGPL)

source: Jmyspell 2.1.4 (LGPL License)
ar: Jmyspell 2.1.4 (رخصة LGPL)

source: SVNKit 1.8.5 (TMate License)
ar: SVNKit 1.8.5 (رخصة TMate)

source: Sequence Library (Sequence Library License)
ar: Sequence Library (رخصة Sequence Library)

source: ANTLR 3.4 (ANTLR 3 License)
ar: ANTLR 3.4 (رخصة ANTLR 3)

source: SQLJet 1.1.10 (GPL License)
ar: SQLJet 1.1.10 (رخصة GPL)

source: JGit (Eclipse Distribution License)
ar: JGit (رخصة Eclipse Distribution)

source: JSch (JSch License)
ar: JSch (رخصة JSch)

source: Base64 (public domain)
ar: Base64 (مُشاع)

source: trilead-ssh2-1.0.0-build217 (Trilead SSH license)
ar: trilead-ssh2-1.0.0-build217 (رخصة Trilead SSH)

source: TinySegmenter (public domain)
ar: TinySegmenter (مُشاع)

source: LanguageTool.jar (LGPL License)
ar: LanguageTool.jar (رخصة LGPL)

source: morfologik-*.jar (Morfologik license)
ar: morfologik-*.jar (رخصة Morfologik)

source: segment-1.4.1.jar (Segment License)
ar: segment-1.4.1.jar (رخصة Segment)

source: lucene-gosen-2.0.2-ipadic.jar (LGPL License)
ar: lucene-gosen-2.0.2-ipadic.jar (رخصة LGPL)

source: SuperTMXMerge-for_OmegaT.jar (LGPL License)
ar: SuperTMXMerge-for_OmegaT.jar (رخصة LGPL)

source: groovy-all-2.2.2.jar (Apache Licence 2.0)
ar: groovy-all-2.2.2.jar (Apache Licence 2.0) slf4j-*.jar (رخصة MIT)

source: slf4j-*.jar (MIT License)
ar: juniversalchardet-1.0.3.jar (GPL)

source: OmegaT license
ar: رخصة OmegaT

source: Last changes
ar: آخر التعديلات

source: Log:
ar: سجل:

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.
ar: هذا البرنامج حر؛ يمكنك إعادة توزيعه و/أو تعديله وفق شروط رخصة جنو العمومية في صيغتها المنشورة من قبل مؤسسة البرمجيات الحرة؛ سواء تعلق اﻷمر بالإصدار رقم 3 من الرخصة، أو بأي إصدار أحدث منه (حسب مشيئتك).

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ar: وزع هذا البرنامج مع الأمل في أن يكون مفيداً لمستخدمه، لكنه لا يتوفر على أية ضمانة؛ بما في ذلك ضمانة صلاحية العرض التجاري أو ضمانة الملاءمة لغرض معين.

source: Edit Filter
ar: تعديل المرشح

source: Confirm removal of pattern {0}
ar: تأكيد حذف النمط Confirm removal of pattern {0}

source: Remove pattern?
ar: هل تريد حذف النمط؟

source: Cannot reset the filter to default patterns.
ar: تعذر إعادة ضبط المرشح على اﻷنماط الافتراضية.

source: Exception occurred:
ar: حصل استثناء:

source: &Defaults
ar: &الإعدادات الافتراضية

source: File &Format
ar: صيغة &الملف

source: Here you may setup the source filename patterns of files the filter will process, customize the filenames of translated files, and select what encodings it will use for loading the file and saving its translated counterpart.
ar: يمكنك هنا ضبط أنماط أسماء ملفات المصدر التي ستُعالج من قبل المرشح، بالإضافة إلى تشخيص أسماء الملفات المترجمة واختيار الترميزات التي ينبغي استعمالها لتحميل الملف وحفظ الترجمة المقابلة.

source: Note: not all filters allow you to select an encoding.
ar: ملاحظة: بعض المرشحات لا تسمح باختيار الترميز.

source: File Filters
ar: مرشحات الملفات

source: Project Specific File Filters
ar: مرشحات الملفات الخاصة بالمشروع

source: &Make the file filter settings project specific
ar: &جعل إعدادات مرشحات الملفات خاصة بالمشروع

source: View or edit file filters.
ar: عرض أو تعديل مرشحات الملفات.

source: To edit what files in what encodings the filter will process, select the filter from the list and click Edit.
ar: لتحديد الملفات التي ستعالج من قبل المرشح والترميزات الخاصة بها، اختر المرشح من القائمة وانقر على 'تعديل'.

source: If the filter has any options, you may change them by clicking Options.
ar: إذا كان المرشح يتوفر على أي خيارات، فبإمكانك تغييرها من خلال النقر على 'خيارات'.

source: Edit Filter Patterns
ar: تعديل أنماط المرشح

source: O&ptions...
ar: &خيارات...

source: Remove leading and trailing tags
ar: حذف العلامات اﻷمامية والخلفية

source: Remove leading and trailing whitespace in non-segmented projects
ar: حذف المسافات البيضاء اﻷمامية والخلفية في المشاريع غير المجزءة

source: Preserve spaces for all tags
ar: حفظ المسافات لكافة العلامات

source: Ignore file context when identifying segments with alternate translations
ar: تجاهل سياق الملف عند العثور على مقاطع متوفرة على ترجمات بديلة

source: Add Pattern
ar: إضافة نمط

source: Edit Pattern
ar: تعديل نمط

source: Source Filename Pattern:
ar: نمط اسم ملف المصدر:

source: Source File Encoding:
ar: ترميز ملف المصدر:

source: Translated File Encoding:
ar: ترميز ملف الترجمة:

source: Filename Variables:
ar: متغيرات اسم الملف:

source: Project autosaved on {0}
ar: مشروع محفوظ تلقائياً على {0}

source: Too big HTML file!
ar: ملف HTML كبير جداً!

source: Invalid HTML file
ar: ملف HTML غير صالح

source: HTML and XHTML
ar: HTML وXHTML

source: Note: Source File Encoding setting affects only the HTML files that have no encoding declaration inside.
ar: ملاحظة: لا تؤثر الإعدادات المتعلقة بترميز ملف المصدر إلا على ملفات HTML التي لا تتضمن أي تصريح خاص بالترميز.

source: If HTML file has the encoding declaration, it will be used disregarding any value you set in this dialog.
ar: في حالة ما إذا كان ملف HTML يتوفر على تصريح خاص بالترميز، فإنه سيستخدم بغض النظر عن القيمة التي ستقوم بضبطها في مربع الحوار هذا.

source: (X)HTML Filter Options
ar: (X)HTML خيارات مرشح

source: Add or rewrite encoding declaration in HTML and XHTML files:
ar: إضافة أو إعادة كتابة التصريح الخاص بالترميز في ملفات HTML وXHTML:

source: &Always
ar: &دائماً

source: Only if (X)HTML file has a &header
ar: فقط إذا كان ملف (X)HTML يتوفر على &ترويسة

source: Skip text matching regular expression:
ar: تخطي النص المتطابق مع التعبير النظامي:

source: Bad regular expression
ar: تعبير نظامي خاطئ
